class Sigunu():

    def get_list(self, sigunu):

        if sigunu == '서울':
            return self.seoul
        elif sigunu == '인천':
            return self.incheon
        elif sigunu == '대전':
            return self.daejeon
        elif sigunu == '광주':
            return self.gwangju
        elif sigunu == '대구':
            return self.daegu
        elif sigunu == '부산':
            return self.busan            
        elif sigunu == '울산':
            return self.ulsan            
        elif sigunu == '세종':
            return self.sejong            
        elif sigunu == '경기':
            return self.gyeonggi      
        elif sigunu == '충북':
            return self.chungbuk         
        elif sigunu == '충남':
            return self.chungnam         
        elif sigunu == '전북':
            return self.jeonbuk         
        elif sigunu == '전남':
            return self.jeonnam          
        elif sigunu == '경북':
            return self.gyeongbuk          
        elif sigunu == '경남':
            return self.gyeongnam        
        elif sigunu == '제주':
            return self.jeju

    seoul = (
        ('종로구','종로구'),
        ('중구','중구'),
        ('용산','용산'),
        ('성동','성동'),
        ('광진','광진'),
        ('동대문','동대문'),
        ('중랑구','중랑구'),
        ('성북구','성북구'),
        ('강북구','강북구'),
        ('도봉구','도봉구'),
        ('노원구','노원구'),
        ('은평구','은평구'),
        ('서대문구','서대문구'),
        ('마포구','마포구'),
        ('양천구','양천구'),
        ('강서구','강서구'),
        ('구로구','구로구'),
        ('금천구','금천구'),
        ('영등포구','영등포구'),
        ('동작구','동작구'),
        ('관악구','관악구'),
        ('서초구','서초구'),
        ('강남구','강남구'),
        ('송파구','송파구'),
        ('강동','강동'),
    )

    busan = (
        ("중구","중구"),
        ("서구","서구"),
        ("동구","동구"),
        ("영도구","영도구"),
        ("부산진구","부산진구"),
        ("동래구","동래구"),
        ("남구","남구"),
        ("북구","북구"),
        ("강서구","강서구"),
        ("해운대구","해운대구"),
        ("사하구","사하구"),
        ("금정구","금정구"),
        ("연제구","연제구"),
        ("수영구","수영구"),
        ("사상구","사상구"),
        ("기장군","기장군"),
    )

    incheon = (
        ("중구","중구"),
        ("동구","동구"),
        ("남구","남구"),
        ("연수구","연수구"),
        ("남동구","남동구"),
        ("부평구","부평구"),
        ("계양구","계양구"),
        ("서구","서구"),
        ("강화군","강화군"),
        ("옹진군","옹진군"),
    )
    daegu = (
        ("중구","중구"),
        ("동구","동구"),
        ("서구","서구"),
        ("남구","남구"),
        ("북구","북구"),
        ("수성구","수성구"),
        ("달서구","달서구"),
        ("달성군","달성군"),
    )
    gwangju = (
        ("동구","동구"),
        ("서구","서구"),
        ("남구","남구"),
        ("북구","북구"),
        ("광산구","광산구"),
    )
    daejeon = (
        ("동구","동구"),
        ("중구","중구"),
        ("서구","서구"),
        ("유성구","유성구"),
        ("대덕구","대덕구"),
    )
    ulsan = (
        ("중구","중구"),
        ("남구","남구"),
        ("동구","동구"),
        ("북구","북구"),
        ("울주군","울주군"),
    )
    sejong = (
        ("세종","세종"),
    )
    gyeonggi = (
        ("가평군","가평군"),
        ("고양시","고양시"),
        ("과천시","과천시"),
        ("광명시","광명시"),
        ("광주시","광주시"),
        ("구리시","구리시"),
        ("군포시","군포시"),
        ("김포시","김포시"),
        ("남양주시","남양주시"),
        ("동두천시","동두천시"),
        ("부천시","부천시"),
        ("성남시","성남시"),
        ("수원시","수원시"),
        ("시흥시","시흥시"),
        ("안산시","안산시"),
        ("안성시","안성시"),
        ("안양시","안양시"),
        ("양주시","양주시"),
        ("양평군","양평군"),
        ("여주시","여주시"),
        ("연천군","연천군"),
        ("오산시","오산시"),
        ("용인시","용인시"),
        ("의왕시","의왕시"),
        ("의정부시","의정부시"),
        ("이천시","이천시"),
        ("파주시","파주시"),
        ("평택시","평택시"),
        ("포천시","포천시"),
        ("하남시","하남시"),
        ("화성시","화성시"),
    )
    gangwon = (
        ("원주시","원주시"),
        ("춘천시","춘천시"),
        ("강릉시","강릉시"),
        ("동해시","동해시"),
        ("속초시","속초시"),
        ("삼척시","삼척시"),
        ("홍천군","홍천군"),
        ("태백시","태백시"),
        ("철원군","철원군"),
        ("횡성군","횡성군"),
        ("평창군","평창군"),
        ("영월군","영월군"),
        ("정선군","정선군"),
        ("인제군","인제군"),
        ("고성군","고성군"),
        ("양양군","양양군"),
        ("화천군","화천군"),
        ("양구군","양구군"),
    )
    chungbuk = (
        ("청주시","청주시"),
        ("충주시","충주시"),
        ("제천시","제천시"),
        ("보은군","보은군"),
        ("옥천군","옥천군"),
        ("영동군","영동군"),
        ("증평군","증평군"),
        ("진천군","진천군"),
        ("괴산군","괴산군"),
        ("음성군","음성군"),
        ("단양군","단양군"),
    )
    chungnam = (
        ("천안시","천안시"),
        ("공주시","공주시"),
        ("보령시","보령시"),
        ("아산시","아산시"),
        ("서산시","서산시"),
        ("논산시","논산시"),
        ("계룡시","계룡시"),
        ("당진시","당진시"),
        ("금산군","금산군"),
        ("부여군","부여군"),
        ("서천군","서천군"),
        ("청양군","청양군"),
        ("홍성군","홍성군"),
        ("예산군","예산군"),
        ("태안군","태안군"),
    )
    gyeongbuk = (
        ("포항시","포항시"),
        ("경주시","경주시"),
        ("김천시","김천시"),
        ("안동시","안동시"),
        ("구미시","구미시"),
        ("영주시","영주시"),
        ("영천시","영천시"),
        ("상주시","상주시"),
        ("문경시","문경시"),
        ("경산시","경산시"),
        ("군위군","군위군"),
        ("의성군","의성군"),
        ("청송군","청송군"),
        ("영양군","영양군"),
        ("영덕군","영덕군"),
        ("청도군","청도군"),
        ("고령군","고령군"),
        ("성주군","성주군"),
        ("칠곡군","칠곡군"),
        ("예천군","예천군"),
        ("봉화군","봉화군"),
        ("울진군","울진군"),
        ("울릉군","울릉군"),
    )
    gyeongnam = (
        ("창원시","창원시"),
        ("김해시","김해시"),
        ("진주시","진주시"),
        ("양산시","양산시"),
        ("거제시","거제시"),
        ("통영시","통영시"),
        ("사천시","사천시"),
        ("밀양시","밀양시"),
        ("함안군","함안군"),
        ("거창군","거창군"),
        ("창녕군","창녕군"),
        ("고성군","고성군"),
        ("하동군","하동군"),
        ("합천군","합천군"),
        ("남해군","남해군"),
        ("함양군","함양군"),
        ("산청군","산청군"),
        ("의령군","의령군"),
    )
    jeonbuk = (
        ("전주시","전주시"),
        ("익산시","익산시"),
        ("군산시","군산시"),
        ("정읍시","정읍시"),
        ("완주군","완주군"),
        ("김제시","김제시"),
        ("남원시","남원시"),
        ("고창군","고창군"),
        ("부안군","부안군"),
        ("임실군","임실군"),
        ("순창군","순창군"),
        ("진안군","진안군"),
        ("장수군","장수군"),
        ("무주군","무주군"),
    )
    jeonnam = (
        ("여수시","여수시"),
        ("순천시","순천시"),
        ("목포시","목포시"),
        ("광양시","광양시"),
        ("나주시","나주시"),
        ("무안군","무안군"),
        ("해남군","해남군"),
        ("고흥군","고흥군"),
        ("화순군","화순군"),
        ("영암군","영암군"),
        ("영광군","영광군"),
        ("완도군","완도군"),
        ("담양군","담양군"),
        ("장성군","장성군"),
        ("보성군","보성군"),
        ("신안군","신안군"),
        ("장흥군","장흥군"),
        ("강진군","강진군"),
        ("함평군","함평군"),
        ("진도군","진도군"),
        ("곡성군","곡성군"),
        ("구례군","구례군"),
    )
    jeju = (
        ("제주시","제주시"),
        ("서귀포시","서귀포시"),
    )